api/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "kimnjo"], ["email", "kim@mail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-03-22 08:23:43.332031"], ["updated_at", "2023-03-22 08:23:43.332031"]]
---
    def register
        user = User.create(user_params)

SELECT "users".* FROM "users" WHERE (userrname = 'kimkim' OR email = NULL) ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    def login
        sql = "username = :username OR email = :email"
        user = User.where(sql, { username: user_params[:username], email: user_params[:email] }).first